import { _decorator } from "cc";
import mk from "mk";
const { ccclass, property } = _decorator;

@ccclass("resources_module_layer_control")
export class resources_module_layer_control extends mk.module.view_base {
	/* --------------- static --------------- */
	/* --------------- 属性 --------------- */
	/* --------------- public --------------- */
	/* --------------- protected --------------- */
	/* --------------- private --------------- */
	/* ------------------------------- 生命周期 ------------------------------- */
	// init(init_?: typeof this.init_data): void {}
	// open(): void {}
	// close(): void {}
	/* ------------------------------- 按钮事件 ------------------------------- */
	/* ------------------------------- 功能 ------------------------------- */
	/* ------------------------------- 网络事件 ------------------------------- */
	/* ------------------------------- 自定义事件 ------------------------------- */
}
