/* eslint-disable no-undef */
"use strict";
module.exports = {
	名字: "mk-framework",
	说明: "3.x 游戏框架",
	安装框架: "安装框架",
	本地版本: "本地版本",
	构建dts: "构建 d.ts",
	帮助: "帮助",
	确认安装: "确定覆盖旧框架进行安装？",
	确认: "确认",
	取消: "取消",
	帮助内容: ["示例项目：https://gitee.com/muzzik/MKFramework", "QQ 交流群：348096019", "微信：_muzzik"].join("\n"),
	安全检查: "安全检查",
	获取版本: "获取版本",
	下载框架: "下载框架",
	版本适配: "版本适配",
	injection_framework: "注入框架",
	注入声明文件: "注入声明文件",
	添加导入映射: "添加导入映射",
	屏蔽vscode框架文件提示: "屏蔽 vscode 框架文件提示",
	清理临时文件: "清理临时文件",
	更新框架版本信息: "更新框架版本信息",
	当前项目未安装框架: "当前项目未安装框架",
	当前项目框架版本为: "当前项目框架版本为",
	安装成功: "安装成功，请重启编辑器后使用"
};
